package filling;

import entity.Person;

import java.util.List;
import java.util.Random;
import java.util.Scanner;
import java.util.stream.IntStream;

public class RandomFilling implements Filling {

    private static final String[] manSurnames = {"Иванов", "Сапелкин", "Лесков", "Жуков", "Семменов", "Добров", "Пашин", "Добрышев",
            "Крылов", "Федоров", "Зайцев", "Агафонов", "Булгаков", "Изерский", "Кошенев", "Смирнов", "Тарасенко",
            "Решетилов", "Виноградов", "Пораскев", "Вышегородцев", "Веденькин", "Некрасов", "Хаметов", "Владимиров",
            "Собачкин", "Перец", "Владимиров", "Шахболатов", "Сапелкин", "Константинов", "Лебедев", "Лосинский",
            "Буслаев", "Тараканов", "Назаров", "Будапештов", "Цыганов", "Шахболатов", "Николаев"};

    private static final String[] manNames = {"Иван", "Андрей", "Марат", "Владимир", "Артур", "Сергей", "Владимир", "Вадим",
            "Александр", "Владимир", "Евгений", "Серафим", "Роман", "Дмитрий", "Олег", "Глеб", "Климент", "Виталий", "Севастьян",
            "Варлам", "Виктор", "Лев", "Софрон", "Милан", "Антон", "Станислав", "Эдисон", "Сергей", "Кузьма", "Федор", "Никифор",
            "Богдан", "Иннокентий", "Петр", "Григорий", "Арсений", "Ахмед", "Арсений", "Заур", "Потап"};

    private static final String[] womanSurnames = {"Иванова", "Сапелкина", "Лескова", "Жукова", "Семменова", "Доброва", "Пашина", "Добрышева",
            "Крылова", "Федорова", "Зайцева", "Агафонова", "Булгакова", "Изерская", "Кошенева", "Смирнова", "Тарасенко",
            "Решетилова", "Виноградова", "Пораскева", "Вышегородцева", "Веденькина", "Некрасова", "Хаметова", "Владимирова",
            "Собачкина", "Перец", "Владимирова", "Шахболатова", "Сапелкина", "Константинова", "Лебедева", "Лосинская",
            "Буслаева", "Тараканова", "Назарова", "Смирнова", "Цыганова", "Шахболатова", "Николаева"};

    private static final String[] womanNames = {"Иванна", "Анна", "Марина", "Влада", "Арина", "Светлана", "Виктория", "Жанна", "Александра", "Жасмин"
            , "Евгения", "София", "Роза", "Жасмин", "Ангелиина", "Зинаида", "Ксения", "Ульяна", "Любовь", "Виолетта", "Анжелика",
            "Елизавета", "Анна", "Милана", "Алефтина", "Инесса", "Римма", "Пелагея", "Маина", "Снежанна", "Злата", "Серафима", "Юлия",
            "Варвара", "Лидия", "Урсула", "Маргарита", "Ярослава", "Антонина", "Аделина"};

    private static final String[][] surnames = {manSurnames, womanSurnames};
    private static final String[][] names = {manNames, womanNames};

    @Override
    public void readData(int size, Scanner sc, List<Person> people) {
        Random random = new Random();
        IntStream.range(0, size)
                .map(i -> random.nextInt(2))
                .mapToObj(i -> new Person.Builder()
                        .surname(surnames[i][random.nextInt(surnames[i].length)])
                        .name(names[i][random.nextInt(names[i].length)])
                        .age(random.nextInt(1, 123))
                        .build())
                .forEach(people::add);

        System.out.println("Данные добавлены");
    }
}